espressif/esp-idf/components/soc/esp32c3/register/soc/ledc_reg.h
#define LEDC_LSTIMER3_CONF_REG          (DR_REG_LEDC_BASE + 0x00b8)
/* LEDC_LSTIMER3_PARA_UP : WO ;bitpos:[25] ;default: 1'h0 ; */
/*description: */
#define LEDC_LSTIMER3_PARA_UP  (BIT(25))
#define LEDC_LSTIMER3_PARA_UP_M  (BIT(25))
#define LEDC_LSTIMER3_PARA_UP_V  0x1
#define LEDC_LSTIMER3_PARA_UP_S  25
/* LEDC_TICK_SEL_LSTIMER3 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define LEDC_TICK_SEL_LSTIMER3  (BIT(24))
#define LEDC_TICK_SEL_LSTIMER3_M  (BIT(24))
#define LEDC_TICK_SEL_LSTIMER3_V  0x1
#define LEDC_TICK_SEL_LSTIMER3_S  24
/* LEDC_LSTIMER3_RST : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: */
#define LEDC_LSTIMER3_RST  (BIT(23))
#define LEDC_LSTIMER3_RST_M  (BIT(23))
#define LEDC_LSTIMER3_RST_V  0x1
#define LEDC_LSTIMER3_RST_S  23
/* LEDC_LSTIMER3_PAUSE : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_PAUSE  (BIT(22))
#define LEDC_LSTIMER3_PAUSE_M  (BIT(22))
#define LEDC_LSTIMER3_PAUSE_V  0x1
#define LEDC_LSTIMER3_PAUSE_S  22
/* LEDC_CLK_DIV_LSTIMER3 : R/W ;bitpos:[21:4] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_LSTIMER3  0x0003FFFF
#define LEDC_CLK_DIV_LSTIMER3_M  ((LEDC_CLK_DIV_LSTIMER3_V)<<(LEDC_CLK_DIV_LSTIMER3_S))
#define LEDC_CLK_DIV_LSTIMER3_V  0x3FFFF
#define LEDC_CLK_DIV_LSTIMER3_S  4
/* LEDC_LSTIMER3_DUTY_RES : R/W ;bitpos:[3:0] ;default: 4'h0 ; */
/*description: */
#define LEDC_LSTIMER3_DUTY_RES  0x0000000F
#define LEDC_LSTIMER3_DUTY_RES_M  ((LEDC_LSTIMER3_DUTY_RES_V)<<(LEDC_LSTIMER3_DUTY_RES_S))
#define LEDC_LSTIMER3_DUTY_RES_V  0xF
#define LEDC_LSTIMER3_DUTY_RES_S  0

#define LEDC_LSTIMER3_VALUE_REG          (DR_REG_LEDC_BASE + 0x00BC)
/* LEDC_LSTIMER3_CNT : RO ;bitpos:[13:0] ;default: 14'b0 ; */
/*description: */
#define LEDC_LSTIMER3_CNT  0x00003FFF
#define LEDC_LSTIMER3_CNT_M  ((LEDC_LSTIMER3_CNT_V)<<(LEDC_LSTIMER3_CNT_S))
#define LEDC_LSTIMER3_CNT_V  0x3FFF
#define LEDC_LSTIMER3_CNT_S  0

#define LEDC_INT_RAW_REG          (DR_REG_LEDC_BASE + 0x00C0)
/* LEDC_OVF_CNT_LSCH5_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_RAW    (BIT(15))
#define LEDC_OVF_CNT_LSCH5_INT_RAW_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH5_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_RAW_S  15
/* LEDC_OVF_CNT_LSCH4_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_RAW    (BIT(14))
#define LEDC_OVF_CNT_LSCH4_INT_RAW_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH4_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_RAW_S  14
/* LEDC_OVF_CNT_LSCH3_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_RAW    (BIT(13))
#define LEDC_OVF_CNT_LSCH3_INT_RAW_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH3_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_RAW_S  13
/* LEDC_OVF_CNT_LSCH2_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_RAW    (BIT(12))
#define LEDC_OVF_CNT_LSCH2_INT_RAW_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH2_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_RAW_S  12
/* LEDC_OVF_CNT_LSCH1_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_RAW    (BIT(11))
#define LEDC_OVF_CNT_LSCH1_INT_RAW_M  (BIT(11))
#define LEDC_OVF_CNT_LSCH1_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_RAW_S  11
/* LEDC_OVF_CNT_LSCH0_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_RAW    (BIT(10))
#define LEDC_OVF_CNT_LSCH0_INT_RAW_M  (BIT(10))
#define LEDC_OVF_CNT_LSCH0_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_RAW_S  10
/* LEDC_DUTY_CHNG_END_LSCH5_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_S  9
/* LEDC_DUTY_CHNG_END_LSCH4_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_S  8
/* LEDC_DUTY_CHNG_END_LSCH3_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_M  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_S  7
/* LEDC_DUTY_CHNG_END_LSCH2_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_M  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_S  6
/* LEDC_DUTY_CHNG_END_LSCH1_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_M  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_S  5
/* LEDC_DUTY_CHNG_END_LSCH0_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_M  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_S  4
/* LEDC_LSTIMER3_OVF_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_OVF_INT_RAW  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_RAW_M  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER3_OVF_INT_RAW_S  3
/* LEDC_LSTIMER2_OVF_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER2_OVF_INT_RAW  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_RAW_M  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER2_OVF_INT_RAW_S  2
/* LEDC_LSTIMER1_OVF_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER1_OVF_INT_RAW  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_RAW_M  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER1_OVF_INT_RAW_S  1
/* LEDC_LSTIMER0_OVF_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER0_OVF_INT_RAW  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_RAW_M  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER0_OVF_INT_RAW_S  0

#define LEDC_INT_ST_REG          (DR_REG_LEDC_BASE + 0x00c4)
/* LEDC_OVF_CNT_LSCH5_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_ST  (BIT(15))
#define LEDC_OVF_CNT_LSCH5_INT_ST_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH5_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_ST_S  15
/* LEDC_OVF_CNT_LSCH4_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_ST  (BIT(14))
#define LEDC_OVF_CNT_LSCH4_INT_ST_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH4_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_ST_S  14
/* LEDC_OVF_CNT_LSCH3_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_ST  (BIT(13))
#define LEDC_OVF_CNT_LSCH3_INT_ST_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH3_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_ST_S  13
/* LEDC_OVF_CNT_LSCH2_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_ST    (BIT(12))
#define LEDC_OVF_CNT_LSCH2_INT_ST_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH2_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_ST_S  12
/* LEDC_OVF_CNT_LSCH1_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_ST    (BIT(11))
#define LEDC_OVF_CNT_LSCH1_INT_ST_M  (BIT(11))
#define LEDC_OVF_CNT_LSCH1_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_ST_S  11
/* LEDC_OVF_CNT_LSCH0_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_ST    (BIT(10))
#define LEDC_OVF_CNT_LSCH0_INT_ST_M  (BIT(10))
#define LEDC_OVF_CNT_LSCH0_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_ST_S  10
/* LEDC_DUTY_CHNG_END_LSCH5_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_S  9
/* LEDC_DUTY_CHNG_END_LSCH4_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_S  8
/* LEDC_DUTY_CHNG_END_LSCH3_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_M  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_S  7
/* LEDC_DUTY_CHNG_END_LSCH2_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_M  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_S  6
/* LEDC_DUTY_CHNG_END_LSCH1_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_M  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_S  5
/* LEDC_DUTY_CHNG_END_LSCH0_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_M  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_S  4
/* LEDC_LSTIMER3_OVF_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_OVF_INT_ST  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_ST_M  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER3_OVF_INT_ST_S  3
/* LEDC_LSTIMER2_OVF_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER2_OVF_INT_ST  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_ST_M  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER2_OVF_INT_ST_S  2
/* LEDC_LSTIMER1_OVF_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER1_OVF_INT_ST  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_ST_M  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER1_OVF_INT_ST_S  1
/* LEDC_LSTIMER0_OVF_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER0_OVF_INT_ST  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_ST_M  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER0_OVF_INT_ST_S  0

#define LEDC_INT_ENA_REG          (DR_REG_LEDC_BASE + 0xC8)
/* LEDC_OVF_CNT_LSCH5_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_ENA    (BIT(15))
#define LEDC_OVF_CNT_LSCH5_INT_ENA_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH5_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_ENA_S  15
/* LEDC_OVF_CNT_LSCH4_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_ENA    (BIT(14))
#define LEDC_OVF_CNT_LSCH4_INT_ENA_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH4_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_ENA_S  14
/* LEDC_OVF_CNT_LSCH3_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_ENA    (BIT(13))
#define LEDC_OVF_CNT_LSCH3_INT_ENA_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH3_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_ENA_S  13
/* LEDC_OVF_CNT_LSCH2_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_ENA    (BIT(12))
#define LEDC_OVF_CNT_LSCH2_INT_ENA_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH2_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_ENA_S  12
/* LEDC_OVF_CNT_LSCH1_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_ENA    (BIT(11))
#define LEDC_OVF_CNT_LSCH1_INT_ENA_M  (BIT(11))
#define LEDC_OVF_CNT_LSCH1_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_ENA_S  11
/* LEDC_OVF_CNT_LSCH0_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_ENA    (BIT(10))
#define LEDC_OVF_CNT_LSCH0_INT_ENA_M  (BIT(10))
#define LEDC_OVF_CNT_LSCH0_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_ENA_S  10
/* LEDC_DUTY_CHNG_END_LSCH5_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_S  9
/* LEDC_DUTY_CHNG_END_LSCH4_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_S  8
/* LEDC_DUTY_CHNG_END_LSCH3_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_M  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_S  7
/* LEDC_DUTY_CHNG_END_LSCH2_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_M  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_S  6
/* LEDC_DUTY_CHNG_END_LSCH1_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_M  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_S  5
/* LEDC_DUTY_CHNG_END_LSCH0_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_M  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_S  4
/* LEDC_LSTIMER3_OVF_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_OVF_INT_ENA  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_ENA_M  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER3_OVF_INT_ENA_S  3
/* LEDC_LSTIMER2_OVF_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER2_OVF_INT_ENA  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_ENA_M  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER2_OVF_INT_ENA_S  2
/* LEDC_LSTIMER1_OVF_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER1_OVF_INT_ENA  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_ENA_M  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER1_OVF_INT_ENA_S  1
/* LEDC_LSTIMER0_OVF_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER0_OVF_INT_ENA  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_ENA_M  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER0_OVF_INT_ENA_S  0

